# Вычислить число c заданной точностью *d*
# Пример:
# при d = 0.001, π = 3.141
# при d = 0.1, π = 3.1
# при d = 0.00001, π = 3.14154
# d от 0.1 до 0.0000000001

from math import pi

d = input(f"Введите необходимую точность числа π от {10**(-1)} до {10**(-10)}: ")

linePi = str(pi)
numPi = linePi[:len(d)]

print(f"π = {numPi}")